app/controllers/api/peso_asignaturas_controller.rb

    def index
        @pesoAsignaturas_paginated = PesoAsignatura.all
---
SELECT "peso_asignaturas".* FROM "peso_asignaturas"