app/controllers/asignaturas_importantes_controller.rb

            b = asignaturasConCT[k][1]
            if(a == b)
              nombreAux =  asignaturasConCT[k][0]
              peso = PesoAsignatura.where(cod_asig: asignaturasConCT[k][1], cod_carr: alumnoCarr[0]['car_cod'])
---
SELECT  "peso_asignaturas".* FROM "peso_asignaturas" WHERE "peso_asignaturas"."cod_asig" = $1 AND "peso_asignaturas"."cod_carr" = $2 LIMIT $3  [["cod_asig", 10101], ["cod_carr", 1353], ["LIMIT", 1]]